## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cosmos.azurerm_cosmosdb_account.db has been deleted
  - resource "azurerm_cosmosdb_account" "db" {
        id                                           = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.DocumentDB/databaseAccounts/ruut-tf-cosmos-db-39756"
      - name                                         = "ruut-tf-cosmos-db-39756" -> null
        # (28 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.cosmos.azurerm_cosmosdb_mongo_database.main has been deleted
  - resource "azurerm_cosmosdb_mongo_database" "main" {
        id                  = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.DocumentDB/databaseAccounts/ruut-tf-cosmos-db-39756/mongodbDatabases/main"
      - name                = "main" -> null
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.cosmos.azurerm_cosmosdb_account.db will be created
  + resource "azurerm_cosmosdb_account" "db" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + connection_strings                           = (sensitive value)
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + enable_automatic_failover                    = true
      + enable_free_tier                             = false
      + enable_multiple_write_locations              = false
      + endpoint                                     = (known after apply)
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "MongoDB"
      + local_authentication_disabled                = false
      + location                                     = "swedencentral"
      + mongo_server_version                         = (known after apply)
      + name                                         = "ruut-tf-cosmos-db-39756"
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = true
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "rg-prod"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + write_endpoints                              = (known after apply)

      + capabilities {
          + name = "EnableMongo"
        }
      + capabilities {
          + name = "MongoDBv3.4"
        }

      + consistency_policy {
          + consistency_level       = "BoundedStaleness"
          + max_interval_in_seconds = 300
          + max_staleness_prefix    = 100000
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "swedencentral"
          + zone_redundant    = false
        }
    }

  # module.cosmos.azurerm_cosmosdb_mongo_collection.lagfest will be created
  + resource "azurerm_cosmosdb_mongo_collection" "lagfest" {
      + account_name        = "ruut-tf-cosmos-db-39756"
      + database_name       = "main"
      + default_ttl_seconds = 777
      + id                  = (known after apply)
      + name                = "ruut-lagfest"
      + resource_group_name = "rg-prod"
      + shard_key           = "uniqueKey"
      + system_indexes      = (known after apply)
      + throughput          = 400
    }

  # module.cosmos.azurerm_cosmosdb_mongo_collection.tatiseta will be created
  + resource "azurerm_cosmosdb_mongo_collection" "tatiseta" {
      + account_name        = "ruut-tf-cosmos-db-39756"
      + database_name       = "main"
      + default_ttl_seconds = 777
      + id                  = (known after apply)
      + name                = "ruut-tatiseta"
      + resource_group_name = "rg-prod"
      + shard_key           = "uniqueKey"
      + system_indexes      = (known after apply)
      + throughput          = 400
    }

  # module.cosmos.azurerm_cosmosdb_mongo_database.main will be created
  + resource "azurerm_cosmosdb_mongo_database" "main" {
      + account_name        = "ruut-tf-cosmos-db-39756"
      + id                  = (known after apply)
      + name                = "main"
      + resource_group_name = "rg-prod"
      + throughput          = 400
    }

  # module.function.azurerm_linux_function_app.backend will be updated in-place
  ~ resource "azurerm_linux_function_app" "backend" {
        id                                             = "/subscriptions/5bf939cb-d804-407e-9bef-78fa99c4ef04/resourceGroups/rg-prod/providers/Microsoft.Web/sites/ruut-backend-function-app"
        name                                           = "ruut-backend-function-app"
        tags                                           = {}
      + zip_deploy_file                                = "function.zip"
        # (27 unchanged attributes hidden)

      ~ site_config {
            # (22 unchanged attributes hidden)

          + application_stack {
              + python_version              = "3.10"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
</details>